SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
  /*Configure GPIO pins : I2S3_MCK_Pin I2S3_SCK_Pin I2S3_SD_Pin */
  GPIO_InitStruct.Pin = I2S3_MCK_Pin|I2S3_SCK_Pin|I2S3_SD_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : VBUS_FS_Pin */
  GPIO_InitStruct.Pin = VBUS_FS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(VBUS_FS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : OTG_FS_ID_Pin OTG_FS_DM_Pin OTG_FS_DP_Pin */
  GPIO_InitStruct.Pin = OTG_FS_ID_Pin|OTG_FS_DM_Pin|OTG_FS_DP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
  GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : Audio_SCL_Pin Audio_SDA_Pin */
  GPIO_InitStruct.Pin = Audio_SCL_Pin|Audio_SDA_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : MEMS_INT2_Pin */
  GPIO_InitStruct.Pin = MEMS_INT2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(MEMS_INT2_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void apply_mask(uint8_t *data, size_t len, const uint8_t *mask_key) {
    for (size_t i = 0; i < len; i++) {
        data[i] ^= mask_key[i % WEBSOCKET_MASK_KEY_SIZE];
    }
}

void send_websocket_message(uint8_t socket, const char *message) {
	printf("send_websocket_message\r\n");
    size_t msg_len = strlen(message);
    uint8_t mask_key[WEBSOCKET_MASK_KEY_SIZE];
    for (int i = 0; i < WEBSOCKET_MASK_KEY_SIZE; i++) {
        mask_key[i] = rand() % 256;
    }

    uint8_t masked_message[msg_len];
    memcpy(masked_message, message, msg_len);
    apply_mask(masked_message, msg_len, mask_key);

    uint8_t frame[2 + WEBSOCKET_MASK_KEY_SIZE + msg_len];
    frame[0] = 0x81; // FIN bit set, opcode for text frame
    frame[1] = 0x80 | msg_len; // MASK bit set, payload length
    memcpy(frame + 2, mask_key, WEBSOCKET_MASK_KEY_SIZE);
    memcpy(frame + 2 + WEBSOCKET_MASK_KEY_SIZE, masked_message, msg_len);

    send(socket, frame, sizeof(frame));
}

// Hilfsfunktion zum Vergleichen von JSON-Schlüsseln
int jsoneq(const char* json, jsmntok_t* tok, const char* s) {
    if (tok->type == JSMN_STRING && (int)strlen(s) == tok->end - tok->start &&
        strncmp(json + tok->start, s, tok->end - tok->start) == 0) {
        return 0;
    }
    return -1;
}


void process_received_data(const char* data) {
    jsmn_parser parser;
    jsmntok_t tokens[JSON_TOKENS];
    int token_count;

    printf("Raw data: %s\n", data); // Ausgabe der empfangenen Rohdaten

    jsmn_init(&parser);
    token_count = jsmn_parse(&parser, data, strlen(data), tokens, JSON_TOKENS);

    if (token_count < 0) {
        printf("Failed to parse JSON: %d\n", token_count);
        return;
    }

    // Prüfe, ob das erste Token ein Objekt ist
    if (token_count < 1 || tokens[0].type != JSMN_OBJECT) {
        printf("Object expected\n");
        return;
    }


    for (int i = 1; i < token_count; i++) {
        if (jsoneq(data, &tokens[i], "message_type") == 0) {
            printf("Message Type: %.*s\n", tokens[i + 1].end - tokens[i + 1].start, data + tokens[i + 1].start);
            i++;
        }
    }
}

// Funktion zum Hex-Dump
void print_hex(const uint8_t *data, uint16_t len) {
    for (uint16_t i = 0; i < len; i++) {
        printf("%02X ", data[i]);
    }
    printf("\n");
}


/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartAliveTask */
/**
  * @brief  Function implementing the AliveTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartAliveTask */
void StartAliveTask(void *argument)
{
  /* USER CODE BEGIN 5 */
  /* Infinite loop */
  for(;;)
  {
	    printf("ToggleLED\r\n");
		//HAL_GPIO_TogglePin(LD2_GPIO_Port, LD2_Pin);
	      HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
	      HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
	      HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
	      HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);

		//osDelay(999); // Warte 1 Sekunde
		vTaskDelay(1000 / portTICK_PERIOD_MS);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartNetworkTask */
/**
* @brief Function implementing the NetworkTask thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartNetworkTask */
void StartNetworkTask(void *argument)
{
  /* USER CODE BEGIN StartwebSocketTask */
	printf("StartwebSocketTask\r\n");
	// otherwise the task freeze
    uint8_t *buf = (uint8_t *)malloc(DATA_BUF_SIZE);
    if (buf == NULL) {
        printf("Failed to allocate memory for buffer\n");
        return;
    }

  uint8_t destip[4] = {192, 168, 178, 25}; // Beispiel-IP-Adresse
  uint16_t destport = 8085; // port

  //uint32_t last_ping_time = 0;
  static uint16_t any_port = 50000;
  uint8_t currentSocketStatus = 0;

  int websocket_upgraded = 0;


  /* Infinite loop */
  for(;;)
  {

      currentSocketStatus = getSn_SR(SOCK_DHCP);
	  //printf("Status of Socket %d is: %d\r\n", SOCK_DHCP, currentSocketStatus);

	  switch (currentSocketStatus) {
	      case SOCK_CLOSED:
	         printf("%d:Socket closed, reopening...\r\n", SOCK_DHCP);

	         if((socket(SOCK_DHCP, Sn_MR_TCP, any_port++, 0x00)) != SOCK_DHCP)
	         {
	            if(any_port == 0xffff) any_port = 50000;
	         }
	         printf("%d:Socket opened\r\n", SOCK_DHCP);
	         break;

	      case SOCK_INIT:
	          printf("Socket is initialized.\r\n");

	          printf("%d:Try to connect to the %d.%d.%d.%d : %d\r\n", SOCK_DHCP, destip[0], destip[1], destip[2], destip[3], destport);

	          if(connect(SOCK_DHCP, destip, destport) != SOCK_OK){
	        	  printf("PROBLEM\r\n");
	          }

	          break;
	      case SOCK_LISTEN:
	          printf("Socket is in listen state.\n");
	          break;








	      case SOCK_ESTABLISHED:
	          printf("Socket is established.\r\n");



