SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
	          if (getSn_IR(SOCK_DHCP) & Sn_IR_CON) {
	              printf("%d: Connected to - %d.%d.%d.%d : %d\r\n", SOCK_DHCP, destip[0], destip[1], destip[2], destip[3], destport);
	              setSn_IR(SOCK_DHCP, Sn_IR_CON);
//	              // Upgrade auf WebSocket
//	              //upgrade_to_websocket(SOCK_DHCP);
	          }



              if (!websocket_upgraded) {
                  if (upgrade_to_websocket(SOCK_DHCP) == 0) {
                      printf("WebSocket upgrade successful.\n");
                      websocket_upgraded = 1; // Upgrade als durchgeführt markieren
                  } else {
                      printf("WebSocket upgrade failed.\n");
                      close(SOCK_DHCP);
                  }
              }




//              // Sende Ping-Nachricht
//              uint32_t current_time = osKernelSysTick();
//              if (current_time - last_ping_time >= PING_INTERVAL) {
//                  send_websocket_message(SOCK_DHCP, "123");
//                  last_ping_time = current_time;
//                  printf("PingTime: %lu\r\n", last_ping_time);
//              }


              // Empfang von WebSocket-Daten
              int32_t ret;
              uint16_t size = 0;

              if ((size = getSn_RX_RSR(SOCK_DHCP)) > 0) {
                  if (size > DATA_BUF_SIZE - 1) size = DATA_BUF_SIZE - 1; // Reserve 1 byte for null termination

                  // Clear the buffer before receiving data
                  memset(buf, 0, DATA_BUF_SIZE);

                  ret = recv(SOCK_DHCP, buf, size);
                  if (ret <= 0) {
                      printf("Error receiving data. Socket closed.\n");
                      close(SOCK_DHCP);
                  } else {
                      buf[ret] = '\0'; // Null termination
                      printf("Empfangene Nachricht: %s\r\n", buf);

                      // Print hex dump of the received data
                      printf("Hex-Dump der empfangenen Daten: ");
                      print_hex(buf, ret);

                      // Skip the first two bytes which might be WebSocket protocol headers
                      char *payload = (char *)(buf + 2);
                      printf("Bereinigte Nachricht: %s\r\n", payload);

                      process_received_data(payload);

                  }
              }
              free(buf);



	          break;
	      case SOCK_CLOSE_WAIT:
	          printf("Socket is closing.\n");
	          break;
	      case SOCK_UDP:
	          printf("Socket is in UDP mode.\n");
	          break;
	      case SOCK_IPRAW:
	          printf("Socket is in IP RAW mode.\n");
	          break;
	      case SOCK_MACRAW:
	          printf("Socket is in MAC RAW mode.\n");
	          break;
	      default:
	          printf("Unknown socket status: %d\n", currentSocketStatus);
	          break;
	  }




	  vTaskDelay(1000 / portTICK_PERIOD_MS); // Vermeide eine enge Schleife

  }


//    int32_t result = loopback_tcpc(SOCK_DHCP, buf, destip, destport);
//
//    // Bearbeite das Ergebnis
//    if (result < 0) {
//        printf("Loopback-TCP-Client-Operation fehlgeschlagen mit Fehlercode: %ld\r\n", (long)result);
//        // Delay to avoid tight loop
//        osDelay(1000); // Warte 1 Sekunde vor dem erneuten Versuch
//    }

//    osDelay(100); // Vermeide eine enge Schleife

  /* USER CODE END StartNetworkTask */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
